app/views/reportes/error.html.erb

<span class="label label-danger"><%= @error.html_safe %></span>
<% if @reporte.reporte_filtros.count > 0 %>
---
SELECT "reporte_filtros".* FROM "reporte_filtros" WHERE "reporte_filtros"."reporte_id" = ?  [["reporte_id", 1]]
SELECT COUNT(*) FROM "reporte_filtros" WHERE "reporte_filtros"."reporte_id" = ?  [["reporte_id", 1]]