app/views/reportes/print.html.erb

SELECT "reporte_filtros".* FROM "reporte_filtros" WHERE "reporte_filtros"."reporte_id" = ?  [["reporte_id", 1]]
SELECT COUNT(*) FROM "reporte_filtros" WHERE "reporte_filtros"."reporte_id" = ?  [["reporte_id", 1]]
---
<% if @reporte.reporte_filtros.count > 0 %>

SELECT "reporte_campos".* FROM "reporte_campos" WHERE "reporte_campos"."reporte_id" = ?  ORDER BY orden  [["reporte_id", 1]]
---
            <thead>
                <% @reporte.reporte_campos.each do |campo| %>