app/views/reportes/show.html.erb

SELECT "reporte_campos".* FROM "reporte_campos" WHERE "reporte_campos"."reporte_id" = ?  ORDER BY orden  [["reporte_id", 1]]
---
            <tbody>
                <% @reporte.reporte_campos.each do |reporte_campo| %>

SELECT "reporte_filtros".* FROM "reporte_filtros" WHERE "reporte_filtros"."reporte_id" = ?  [["reporte_id", 1]]
---
            <tbody>
                <% @reporte.reporte_filtros.each do |reporte_filtro| %>