app/controllers/empleados_controller.rb

  def index
    @empleados = Empleado.all
---
SELECT "empleados".* FROM "empleados"

    def set_empleado
      @empleado = Empleado.find(params[:id])
---
SELECT  "empleados".* FROM "empleados" WHERE "empleados"."id" = ? LIMIT 1  [["id", 1]]