app/controllers/reportes_controller.rb

SELECT "reportes".* FROM "reportes"
---
  def index
    @reportes = Reporte.all

SELECT "reporte_filtros".* FROM "reporte_filtros" WHERE "reporte_filtros"."reporte_id" = ?  [["reporte_id", 1]]
---
  def print
      @parametros =  Hash.new(0)
      @parametros_descriptivo=""
      @reporte.reporte_filtros.each do |filtro|

SELECT  "reportes".* FROM "reportes" WHERE "reportes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_reporte
      @reporte = Reporte.find(params[:id])