app/controllers/reporte_campos_controller.rb

    def set_reporte_campo
      @reporte_campo = ReporteCampo.find(params[:id])
---
SELECT  "reporte_campos".* FROM "reporte_campos" WHERE "reporte_campos"."id" = ?  ORDER BY orden LIMIT 1  [["id", 1]]